{
  "global": {
    "name": "Adrien BOUYSSOU",
    "menu": {
      "links": "Links",
      "resume": "Resume"
    }
  },
  "cv": {
    "welcome": {
      "title": "Hello, I am **Adrien BOUYSSOU**",
      "role": "Full-stack web developer at Viveris Technologies",
      "description": "Software engineer for 4 years, I mainly work with **Java** and JavaScript. I joined Viveris Technologies (Toulouse, France) after my graduation in 2021. I work there as a full-stack engineer. I also work on side projects in my free time.",
      "contact": "Contact me",
      "work": "My work"
    },
    "navbar": {
      "work": "Work",
      "projects": "Projects",
      "personal": "Personal",
      "links": "Links"
    },
    "work": {
      "title": "My professional experiences",
      "experience": {
        "1": {
          "title": "Viveris Technologies",
          "text": "Since 2021, I work at *Viveris Technologies*. Based in Toulouse, I am a developer in an agile team. My tasks change from day to day, week to week, and sprint to sprint. My main skills remain web development, backend with a main API in *Spring*, and frontend with *VueJS* that we are introducing into the project. But I can also work on databases, networking, system administration and CI."
        },
        "2": {
          "title": "Work-study at Eiffage Energie Systèmes",
          "text": "From 2018 to 2021, I attended an engineering school in a work-study program. I worked at *Eiffage-Energie-Systèmes* and studied at *UTBM* (University of Technology of Belfort-Montbéliard). I worked in Mulhouse, Alsace, as a web developer with *Spring Boot* for the backend and *ReactJS* as the frontend framework. For my studies, my university was located in Belfort, near Mulhouse."
        },
        "3": {
          "title": "DUT in Computer Science",
          "text": "I started my higher education with a DUT in Computer Science. I completed this degree from 2016 to 2018 at the IUT of Rodez (University Toulouse 1 Capitole). It allowed me to get a solid introduction to computer science, especially in *Java*. This training also gave me a strong foundation, particularly in relational databases."
        }
      }
    },
    "projects": {
      "title": "My personal projects",
      "experience": {
        "1": {
          "title": "GitHub",
          "text": "Whenever I develop a personal project, I always version it using the essential **Git** on **GitHub**. This allows me to back it up, find all my projects anywhere, and above all, as is the case for this portfolio, to easily deploy my static projects on GitHub Pages thanks to GitHub Actions."
        },
        "2": {
          "title": "Portfolio",
          "text": "My **portfolio** is one of my projects. Initially made in ReactJS, I rebuilt it identically in **JavaScript**. This change allows me to get closer to pure technologies in order to use the tools that best fit each project."
        },
        "3": {
          "title": "Tournament Manager",
          "text": "The **[Tournament-Manager](https://macdrien.github.io/tournament-manager-frontend)** is a Proof Of Concept that I developed as a personal exercise. The goal is to generate a match tree for tournaments. I completed this project by adding a tournament creation form, defining the number of teams and players, and organizing matches randomly. The tournament display allows you to see the current match and present the winner(s). I also used these pages to test a display system with a choice of light and dark themes. I consider its first version finished, but I keep this project aside to add features, with data persistence at the top of the list."
        }
      }
    },
    "personal": {
      "title": "My personal experiences",
      "experience": {
        "1": {
          "title": "Immersion in England",
          "text": "Obtaining an engineering degree requires twelve weeks of international experience. Therefore, I went to work for three months, during the summer of 2019, at *Ace Printwear*, a small company in *Torquay* (Devon, UK), which customizes textiles by flocking, mainly for the many tourists of the English Riviera and local businesses. This experience allowed me to significantly improve my English level up to the B2 required for the degree."
        },
        "2": {
          "title": "On Innov' Competition",
          "text": "In November 2017, I participated in the competition organized as part of the *On Innov'* fair in Onet-Le-Chateau, in the Ruthenian agglomeration. With the KAVAM team, we presented the concept of our mobile game on the theme of energy saving. Our presentation earned us first place in this competition."
        }
      }
    }
  }
}
