{
    "name": "Adrien BOUYSSOU",
    "welcome": {
        "title": "Bonjour, je suis ",
        "role": "Full-stack web developpeur chez Viveris Technologies",
        "description": {
            "text": "Ingénieur logiciel depuis 3 ans,\nje travaille principalement avec {strong} et JavaScript. J'ai rejoint Viveris Technologies (Toulouse, France) après mon diplôme en 2021. J'y travaille comme ingénieur full-stack. Je travaille également sur des side-projects sur mon temps libre.",
            "strong": "Java"
        },
        "contact": "Contactez-moi",
        "work": "Mon travail"
    },
    "navbar": {
        "work": "Travail",
        "projects": "Projets",
        "personal": "Personnel",
        "contact": "Contact"
    },
    "contact": {
        "title": "Contact",
        "email": "adrien.bouyssou@pm.me",
        "linkedin": "www.linkedin.com/in/adrien-bouyssou",
        "location": "Toulouse Sud-Est, Occitanie, France"
    },
    "work": {
        "title": "Mes expériences professionnelles",
        "experience": {
            "1": {
                "title": "Viveris Technologies",
                "text": "Depuis 2021, je travaille chez *Viveris Technologies*. Basé à Toulouse, j'occupe le poste de développeur au sein d'une équipe agile. Mon travail change au fil des jours, des semaines et des sprints.  Mes compétences principales restent le développement web, en back-end avec une API principale en *Spring*, et en front-end avec *VueJS* que nous introduisons dans le projet. Mais, il m'arrive également de travailler sur les bases de données, faire du réseau ou encore de l'administration système et travailler sur la CI du projet."
            },
            "2": {
                "title": "Alternance à Eiffage Energie Systèmes",
                "text": "De 2018 à 2021, j'ai fait une école d'ingénieur en alternance. Je travaillais chez *Eiffage-Energie-Systèmes* et j'étudiais au sein de l'*UTBM* (Université de Technologie de Belfort-Montbéliard).  Je travaillais à Mulhouse, en Alsace, en tant que développeur web avec du *Spring Boot* pour le back-end et en *ReactJS* en framework front-end.  Pour mes études, mon université était localisée à Belfort, proche de Mulhouse."
            },
            "3": {
                "title": "DUT Informatique",
                "text": "J'ai commencé mes études supérieures par un DUT en Informatique. J'ai passé ce diplôme de 2016 à 2018 à l'IUT de Rodez (Université Toulouse 1 Capitole). Cela m'a permi de m'initier correctement à l'informatique, notamment en *Java*. Cette formation m'a également apporté beaucoup de bases solides, notamment en base de données relationnelles."
            }
        }
    },
    "projects": {
        "title": "Mes projets personnels",
        "experience": {
            "1": {
                "title": "GitHub",
                "text": "Lorsque je développe un projet personnel, je le versionne systématiquement vie l'incontournable **Git** sur **GitHub**. Cela me permet de le sauvegarder, de retrouver tous mes projets partour, et surtout, comme c'est le cas pour ce portfolio, de déployer mes projets statiques sur GitHub Pages facilement grâce aux GitHub Actions."
            },
            "2": {
                "title": "Portfolio",
                "text": "Mon **portfolio** est l'un de mes projets. Initialement réalisé en ReactJS, je l'ai refait, à l'identique, en **JavaScript** vanilla. Ce changement me permet de me rapprocher au plus des technologies pures afin d'utiliser les outils qui correspondent au mieux à chaque projet."
            },
            "3": {
                "title": "Tournament Manager",
                "text": "Le **[Tournament-Manager](https://macdrien.github.io/tournament-manager-frontend)** est un Proof Of Concept que j'ai développé sous la forme d'un exercice personnel. L'objectif est de permettre la génération d'un arbre de matchs pour des tournois. J'ai complété ce projet pour y ajouter un formulaire de création de tournois en définissant le nombre d'équipes et de joueurs et organisant les matchs aléatoirement. L'affichage du tournois permet de voir le match en cours et de présenter le.s gagnant.e.s. J'ai également profité de ces pages pour tester un système d'affichage avec le choix d'un thème clair et un sombre. Je considère sa v1 terminée, mais je garde ce projet de côté pour y ajouter de nombreuses foncitonnalités, la persistence de données en tête."
            }
        }
    },
    "personal": {
        "title": "Mes expériences personnelles",
        "experience": {
            "1": {
                "title": "Immersion en Angleterre",
                "text": "L'obtention d'un diplôme d'ingénieur nécessite une expérience de douze semaines à l'international. Par conséquent, je suis parti travailler trois mois, sur l'été 2019, chez *Ace Printwear* une, petite société à *Torquay* (Devon, UK), qui personnalise des textiles grâce à du flocage, principalement pour les nombreux touristes de l'English Riviera et les entreprises locales. Cette expérience m'a permi d'améliorer considérablement mon niveau en anglais jusqu'au B2 nécessaire à l'obtention du diplôme."
            },
            "2": {
                "title": "Concours On Innov'",
                "text": "En novembre 2017, j'ai participé au concours organisé dans le cadre du salon *On Innov'* de Onet-Le-Chateau, dans l'agglomération ruthénoise. Avec l'équipe KAVAM, nous avons présenté le concept de notre jeu mobile sur le thème de l'économie d'énergie. Notre présentation nous a vallu la première place de ce concours."
            }
        }
    }
}